#-*- coding: utf-8 -*-
## 코드를 무단으로 복제하여 개조 및 배포하지 말 것##
## Copyright ⓒ 2020 Dawnclass(새벽반) dawnclass16@naver.com

DNF_wep_list={
    '귀검/나이트':{
        '광검':[
            '(광검)별의 바다 : 바드나후',
            '(광검)적광검 루이너스',
            '(광검)흑천의 주인',
            '(광검)원초의 꿈(5개조)'
            ],
        '소검':[
            '(소검)전장의 열정 : 앵거바딜',
            '(소검)신념의 징표 : 칼리번',
            '(소검)흑천의 주인',
            '(소검)원초의 꿈(5개조)'
            ],
        '둔기':[
            '(둔기)판데모니엄 플레임',
            '(둔기)하티 - 달을 탐하는 자',
            '(둔기)흑천의 주인',
            '(둔기)원초의 꿈(5개조)'
            ],
        '도':[
            '(도)태극천제검',
            '(도)아방가르드',
            '(도)흑천의 주인',
            '(도)원초의 꿈(5개조)'
            ],
        '대검':[
            '(대검)데우스 이미저리',
            '(대검)카심의 대검',
            '(대검)흑천의 주인',
            '(대검)원초의 꿈(5개조)'
            ]
        },
    '격투가':{
        '너클':[
            '(너클)백호의 울음소리',
            '(너클)청명한 의지',
            '(너클)흑천의 주인',
            '(너클)원초의 꿈(5개조)'
            ],
        '통파':[
            '(통파)청사곤',
            '(통파)어그레시브 카이트',
            '(통파)흑천의 주인',
            '(통파)원초의 꿈(5개조)'
            ],
        '클로':[
            '(클로)매드 싸이클론',
            '(클로)로드 오브 더 페인',
            '(클로)흑천의 주인',
            '(클로)원초의 꿈(5개조)'
            ],
        '건틀릿':[
            '(건틀릿)태음신 : 영귀',
            '(건틀릿)디스트로이 프레셔',
            '(건틀릿)흑천의 주인',
            '(건틀릿)원초의 꿈(5개조)'
            ],
        '권투글러브':[
            '(권투글러브)블레이즈 헌터',
            '(권투글러브)일렉트로 부스터',
            '(권투글러브)흑천의 주인',
            '(권투글러브)원초의 꿈(5개조)'
            ]
        },
    '거너':{
        '자동권총':[
            '(자동권총)팔로우 더 스타티스',
            '(자동권총)메가쇼크 런처',
            '(자동권총)흑천의 주인',
            '(자동권총)원초의 꿈(5개조)'
            ],
        '보우건':[
            '(보우건)커스텀 라이져 보우',
            '(보우건)음유시인의 만돌린',
            '(보우건)흑천의 주인',
            '(보우건)원초의 꿈(5개조)'
            ],
        '리볼버':[
            '(리볼버)미드나잇 러시안 룰렛',
            '(리볼버)블러드 샷 부스터',
            '(리볼버)흑천의 주인',
            '(리볼버)원초의 꿈(5개조)'
            ],
        '머스켓':[
            '(머스켓)터뷸런스',
            '(머스켓)스트라이커-X',
            '(머스켓)흑천의 주인',
            '(머스켓)원초의 꿈(5개조)'
            ],
        '핸드캐넌':[
            '(핸드캐넌)레볼루션 차지',
            '(핸드캐넌)오버스펙 라이즈',
            '(핸드캐넌)흑천의 주인',
            '(핸드캐넌)원초의 꿈(5개조)'
            ]
        },
    '마법사':{
        '스태프':[
            '(스태프)세계수의 뿌리',
            '(스태프)루나 베네딕티오',
            '(스태프)흑천의 주인',
            '(스태프)원초의 꿈(5개조)'
            ],
        '로드':[
            '(로드)플레임 헬',
            '(로드)마력의 샘 : 카스탈리아',
            '(로드)흑천의 주인',
            '(로드)원초의 꿈(5개조)'
            ],
        '봉':[
            '(봉)우디 부기',
            '(봉)카오스 시드',
            '(봉)흑천의 주인',
            '(봉)원초의 꿈(5개조)'
            ],
        '창':[
            '(창)어나이얼레이터',
            '(창)영창 : 불멸의 혼',
            '(창)흑천의 주인',
            '(창)원초의 꿈(5개조)'
            ],
        '빗자루':[
            '(빗자루)세계수의 요정',
            '(빗자루)순백의 기도',
            '(빗자루)흑천의 주인',
            '(빗자루)원초의 꿈(딜5개조/벞3개조)'
            ]
        },
    '프리스트':{
        '십자가':[
            '(십자가)포 더 세크리드',
            '(십자가)눈부신 영광',
            '(십자가)흑천의 주인',
            '(십자가)원초의 꿈(딜5개조/벞3개조)'
            ],
        '염주':[
            '(염주)윤회의 고리 : 환룡',
            '(염주)고대 신수의 기억',
            '(염주)흑천의 주인',
            '(염주)원초의 꿈(5개조)'
            ],
        '토템':[
            '(토템)라스트 인파이팅',
            '(토템)개척자의 길',
            '(토템)흑천의 주인',
            '(토템)원초의 꿈(5개조)'
            ],
        '배틀액스':[
            '(배틀액스)불카누스의 두번째 흔적',
            '(배틀액스)신념의 무게',
            '(배틀액스)흑천의 주인',
            '(배틀액스)원초의 꿈(5개조)'
            ],
        '낫':[
            '(낫)루즈 리즌',
            '(낫)이교도 교주의 심판',
            '(낫)흑천의 주인',
            '(낫)원초의 꿈(5개조)'
            ]
        },
    '도적':{
        '단검':[
            '(단검)샤프 쉐도어',
            '(단검)암살단장의 옥장도',
            '(단검)흑천의 주인',
            '(단검)원초의 꿈(5개조)'
            ],
        '쌍검':[
            '(쌍검)화려한 눈속임',
            '(쌍검)핏빛 무도회',
            '(쌍검)흑천의 주인',
            '(쌍검)원초의 꿈(5개조)'
            ],
        '완드':[
            '(완드)푸른 생명의 이면',
            '(완드)고결한 정령의 유물',
            '(완드)흑천의 주인',
            '(완드)원초의 꿈(5개조)'
            ],
        '차크라웨펀':[
            '(차크라웨펀)블러드 루비아이',
            '(차크라웨펀)도화선',
            '(차크라웨펀)흑천의 주인',
            '(차크라웨펀)원초의 꿈(5개조)'
            ]
        },
    '마창사':{
        '장창':[
            '(장창)끊임없는 환영',
            '(장창)전장의 선봉장',
            '(장창)흑천의 주인',
            '(장창)원초의 꿈(5개조)'
            ],
        '미늘창':[
            '(미늘창)통곡의 수문장',
            '(미늘창)사암주극',
            '(미늘창)흑천의 주인',
            '(미늘창)원초의 꿈(5개조)'
            ],
        '광창':[
            '(광창)일렉트로전',
            '(광창)천장군 : 전승의 빛',
            '(광창)흑천의 주인',
            '(광창)원초의 꿈(5개조)'
            ],
        '투창':[
            '(투창)사일런트 베놈',
            '(투창)기가 드릴러',
            '(투창)흑천의 주인',
            '(투창)원초의 꿈(5개조)'
            ]
        },
    '총검사':{
        '장도':[
            '(장도)금강비장도',
            '(장도)야천도',
            '(장도)흑천의 주인',
            '(장도)원초의 꿈(5개조)'
            ],
        '소태도':[
            '(소태도)차갑게 굳어버린 홍염',
            '(소태도)다크 플레임 리퍼',
            '(소태도)흑천의 주인',
            '(소태도)원초의 꿈(5개조)'
            ],
        '중검':[
            '(중검)아토믹 파일',
            '(중검)홍염폭검',
            '(중검)흑천의 주인',
            '(중검)원초의 꿈(5개조)'
            ],
        '코어블레이드':[
            '(코어블레이드)베투스 코르',
            '(코어블레이드)프로젝트 : 오버코어',
            '(코어블레이드)흑천의 주인',
            '(코어블레이드)원초의 꿈(5개조)'
            ]
        }
    }
                                 
wep_image_filename={
    "00150":"(광검)별의 바다 : 바드나후","00161":"(광검)적광검 루이너스","h12":"(광검)흑천의 주인","00168":"(광검)원초의 꿈(5개조)",
    "00169":"(소검)전장의 열정 : 앵거바딜","00182":"(소검)신념의 징표 : 칼리번","h28":"(소검)흑천의 주인","00190":"(소검)원초의 꿈(5개조)",
    "00162":"(둔기)판데모니엄 플레임","00177":"(둔기)하티 - 달을 탐하는 자","h22":"(둔기)흑천의 주인","00188":"(둔기)원초의 꿈(5개조)",
    "00199":"(도)태극천제검","00181":"(도)아방가르드","h36":"(도)흑천의 주인","00209":"(도)원초의 꿈(5개조)",
    "00183":"(대검)데우스 이미저리","00196":"(대검)카심의 대검","h35":"(대검)흑천의 주인","00210":"(대검)원초의 꿈(5개조)",
    "00186":"(너클)백호의 울음소리","00175":"(너클)청명한 의지","h31":"(너클)흑천의 주인","00194":"(너클)원초의 꿈(5개조)",
    "00169(1)":"(통파)청사곤","00159":"(통파)어그레시브 카이트","h19":"(통파)흑천의 주인","00179":"(통파)원초의 꿈(5개조)",
    "00166":"(클로)매드 싸이클론","00178":"(클로)로드 오브 더 페인","h25":"(클로)흑천의 주인","00188(1)":"(클로)원초의 꿈(5개조)",
    "00174":"(건틀릿)태음신 : 영귀","00161(1)":"(건틀릿)디스트로이 프레셔","h24":"(건틀릿)흑천의 주인","00183(1)":"(건틀릿)원초의 꿈(5개조)",
    "00157":"(권투글러브)블레이즈 헌터","00145":"(권투글러브)일렉트로 부스터","h10":"(권투글러브)흑천의 주인","00164":"(권투글러브)원초의 꿈(5개조)",
    "00179(1)":"(자동권총)팔로우 더 스타티스","00177(1)":"(자동권총)메가쇼크 런처","h26":"(자동권총)흑천의 주인","00187":"(자동권총)원초의 꿈(5개조)",
    "00165":"(보우건)커스텀 라이져 보우","00155":"(보우건)음유시인의 만돌린","h16":"(보우건)흑천의 주인","00175(1)":"(보우건)원초의 꿈(5개조)",
    "00154":"(리볼버)미드나잇 러시안 룰렛","00166(1)":"(리볼버)블러드 샷 부스터","h14":"(리볼버)흑천의 주인","00172":"(리볼버)원초의 꿈(5개조)",
    "00173":"(머스켓)터뷸런스","00159(1)":"(머스켓)스트라이커-X","h20":"(머스켓)흑천의 주인","00182(1)":"(머스켓)원초의 꿈(5개조)",
    "00171":"(핸드캐넌)레볼루션 차지","00159(2)":"(핸드캐넌)오버스펙 라이즈","h18":"(핸드캐넌)흑천의 주인","178(1)":"(핸드캐넌)원초의 꿈(5개조)",
    "00193":"(스태프)세계수의 뿌리","00177(2)":"(스태프)루나 베네딕티오","h33":"(스태프)흑천의 주인","00200":"(스태프)원초의 꿈(5개조)",
    "00188(2)":"(로드)플레임 헬","00175(3)":"(로드)마력의 샘 : 카스탈리아","h29":"(로드)흑천의 주인","00199(1)":"(로드)원초의 꿈(5개조)",
    "0017400174(1)":"(봉)우디 부기","00176":"(봉)카오스 시드","h23":"(봉)흑천의 주인","00181(1)":"(봉)원초의 꿈(5개조)",
    "00187(1)":"(창)어나이얼레이터","00175(2)":"(창)영창 : 불멸의 혼","h30":"(창)흑천의 주인","00197":"(창)원초의 꿈(5개조)",
    "00161(2)":"(빗자루)세계수의 요정","00149":"(빗자루)순백의 기도","h11":"(빗자루)흑천의 주인","00168(1)":"(빗자루)원초의 꿈(딜5개조/벞3개조)",
    "00165(1)":"(십자가)포 더 세크리드","00154(1)":"(십자가)눈부신 영광","h15":"(십자가)흑천의 주인","00173(1)":"(십자가)원초의 꿈(딜5개조/벞3개조)",
    "00162(1)":"(염주)윤회의 고리 : 환룡","00164(1)":"(염주)고대 신수의 기억","h9":"(염주)흑천의 주인","00169(2)":"(염주)원초의 꿈(5개조)",
    "00182(2)":"(토템)라스트 인파이팅","00167":"(토템)개척자의 길","h27":"(토템)흑천의 주인","00192":"(토템)원초의 꿈(5개조)",
    "00162(2)":"(배틀액스)불카누스의 두번째 흔적","00173(2)":"(배틀액스)신념의 무게","h21":"(배틀액스)흑천의 주인","00185":"(배틀액스)원초의 꿈(5개조)",
    "00157(1)":"(낫)루즈 리즌","00168(2)":"(낫)이교도 교주의 심판","h17":"(낫)흑천의 주인","00175(4)":"(낫)원초의 꿈(5개조)",
    "00180":"(단검)샤프 쉐도어","00191":"(단검)암살단장의 옥장도","h34":"(단검)흑천의 주인","00198":"(단검)원초의 꿈(5개조)",
    "00191(1)":"(쌍검)화려한 눈속임","00189":"(쌍검)핏빛 무도회","h32":"(쌍검)흑천의 주인","00199(2)":"(쌍검)원초의 꿈(5개조)",
    "00212":"(완드)푸른 생명의 이면","00210(1)":"(완드)고결한 정령의 유물","h37":"(완드)흑천의 주인","00219":"(완드)원초의 꿈(5개조)",
    "00150(1)":"(차크라웨펀)블러드 루비아이","00148":"(차크라웨펀)도화선","h8":"(차크라웨펀)흑천의 주인","00155(1)":"(차크라웨펀)원초의 꿈(5개조)",
    "00163":"(장창)끊임없는 환영","00150(2)":"(장창)전장의 선봉장","h13":"(장창)흑천의 주인","00171(1)":"(장창)원초의 꿈(5개조)",
    "00146":"(미늘창)통곡의 수문장","00132":"(미늘창)사암주극","h7":"(미늘창)흑천의 주인","00157(2)":"(미늘창)원초의 꿈(5개조)",
    "00138":"(광창)일렉트로전","00129":"(광창)천장군 : 전승의 빛","h5":"(광창)흑천의 주인","00146(1)":"(광창)원초의 꿈(5개조)",
    "00129(1)":"(투창)사일런트 베놈","00138(1)":"(투창)기가 드릴러","h4":"(투창)흑천의 주인","00145(1)":"(투창)원초의 꿈(5개조)",
    "00141":"(장도)금강비장도","00128":"(장도)야천도","h6":"(장도)흑천의 주인","00150(3)":"(장도)원초의 꿈(5개조)",
    "00134":"(소태도)차갑게 굳어버린 홍염","00124":"(소태도)다크 플레임 리퍼","h2":"(소태도)흑천의 주인","00142":"(소태도)원초의 꿈(5개조)",
    "00121":"(중검)아토믹 파일","00136":"(중검)홍염폭검","h3":"(중검)흑천의 주인","00146(2)":"(중검)원초의 꿈(5개조)",
    "00119":"(코어블레이드)베투스 코르","00128(1)":"(코어블레이드)프로젝트 : 오버코어","h1":"(코어블레이드)흑천의 주인","00135":"(코어블레이드)원초의 꿈(5개조)"
    }

